Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодностиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/goods/Ext/Module.bsl
Функция get()
	ОбъектНоменклатура = ФабрикаXDTO.Тип("http://practicum.yandex.ru", "Номенклатура");
	ОбъектТипНоменклатуры = ФабрикаXDTO.Тип("http://practicum.yandex.ru", "ТипНоменклатуры");
	ОбъектСтатьяЗатрат = ФабрикаXDTO.Тип("http://practicum.yandex.ru", "СтатьяЗатрат");
	ОбъектСписокНоменклатуры = ФабрикаXDTO.Тип("http://practicum.yandex.ru", "СписокНоменклатуры");
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|    Номенклатура.Наименование КАК Наименование,
	|    Номенклатура.Артикул КАК Артикул,
	|    ПРЕДСТАВЛЕНИЕ(Номенклатура.ТипНоменклатуры) КАК ТипНоменклатуры,
	|    Номенклатура.СтатьяЗатрат.Наименование КАК СтатьяЗатрат
	|ИЗ
	|    Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|    НЕ Номенклатура.ПометкаУдаления
	|    И НЕ Номенклатура.ЭтоГруппа";
	СписокНоменклатуры = ФабрикаXDTO.Создать(ОбъектСписокНоменклатуры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Номенклатура = ФабрикаXDTO.Создать(ОбъектНоменклатура);
		ТипНоменклатуры  = ФабрикаXDTO.Создать(ОбъектТипНоменклатуры);
		СтатьяЗатрат = ФабрикаXDTO.Создать(ОбъектСтатьяЗатрат);
		ТипНоменклатуры.Наименование = Выборка.ТипНоменклатуры;
		СтатьяЗатрат.Наименование = Выборка.СтатьяЗатрат;
		Номенклатура.Наименование = Выборка.Наименование;
		Номенклатура.Артикул = Выборка.Артикул;
		Номенклатура.ТипНоменклатуры = ТипНоменклатуры;
		Номенклатура.СтатьяЗатрат = СтатьяЗатрат;
		СписокНоменклатуры.Номенклатура.Добавить(Номенклатура);
	КонецЦикла;
	возврат СписокНоменклатуры;
КонецФункции
